package wh.extractor.domain.model

case class ExtractedRegion(name: String) {
  def city =
    if (name.toLowerCase.contains("область") ||
        name.toLowerCase.contains("край") ||
        name.toLowerCase.contains("республика")) {
      ExtractedRegion.regionToCity.get(name)
    } else {
      Some(name)
    }
}

object ExtractedRegion {
  val regionToCity = Map(
    ("Архангельская область", "Архангельск"),
    ("Брянская область", "Брянск"),
    ("Владимирская область", "Владимир"),
    ("Вологодская область", "Вологда"),
    ("Ивановская область", "Иваново"),
    ("Калужская область", "Калуга"),
    ("Костромская область", "Кострома"),
    ("Ленинградская область", "Ленинград"),
    ("Московская область", "Москва"),
    ("Мурманская область", "Мурманск"),
    ("Нижегородская область", "Нижний Новгород"),
    ("Новгородская область", "Новгород"),
    ("Псковская область", "Псков"),
    ("Республика Карелия", "Республика Карелия"),
    ("Рязанская область", "Рязань"),
    ("Свердловская область", "Свердлов"),
    ("Смоленская область", "Смоленск"),
    ("Тверская область", "Тверь"),
    ("Тульская область", "Тула"),
    ("Челябинская область", "Челябинск"),
    ("Ярославская область", "Ярославль")
  )
}
